<a href="https://colab.research.google.com/github/arikinhafln/data-analytics-activities/blob/main/Exerc%C3%ADcio_Banco_de_dados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
import sqlite3

In [ ]:
 # 1. Criar Tabela "alunos"

 CREATE TABLE alunos (
    id INT PRIMARY KEY,
    nome TEXT,
    idade INT,
    curso TEXT
);

In [5]:
# 2. Inserir Registros na Tabela "alunos"

INSERT INTO alunos (id, nome, idade, curso) VALUES (1, 'João Silva', 22, 'Engenharia');
INSERT INTO alunos (id, nome, idade, curso) VALUES (2, 'Maria Santos', 19, 'Medicina');
INSERT INTO alunos (id, nome, idade, curso) VALUES (3, 'Carlos Oliveira', 25, 'Engenharia');
INSERT INTO alunos (id, nome, idade, curso) VALUES (4, 'Ana Costa', 21, 'Direito');
INSERT INTO alunos (id, nome, idade, curso) VALUES (5, 'Pedro Souza', 20, 'Engenharia');

SyntaxError: invalid syntax (<ipython-input-5-a14fe9eeacfe>, line 3)

In [ ]:
# 3. Consultas Básicas
# a) Selecionar todos os registros da tabela "alunos":
SELECT * FROM alunos;

# b) Selecionar o nome e a idade dos alunos com mais de 20 anos:
SELECT nome, idade FROM alunos WHERE idade > 20;

# c) Selecionar os alunos do curso de "Engenharia" em ordem alfabética:
SELECT nome FROM alunos WHERE curso = 'Engenharia' ORDER BY nome ASC;

# d) Contar o número total de alunos na tabela:
SELECT COUNT(*) FROM alunos;

In [ ]:
# 4. Atualização e Remoção
# a) Atualizar a idade de um aluno específico na tabela:
UPDATE alunos SET idade = 23 WHERE id = 1;

# b) Remover um aluno pelo seu ID:
DELETE FROM alunos WHERE id = 5;

In [ ]:
# 5. Criar Tabela "clientes" e Inserir Dados
CREATE TABLE clientes (
    id INT PRIMARY KEY,
    nome TEXT,
    idade INT,
    saldo FLOAT
);

INSERT INTO clientes (id, nome, idade, saldo) VALUES (1, 'Lucas Lima', 35, 2500.50);
INSERT INTO clientes (id, nome, idade, saldo) VALUES (2, 'Fernanda Alves', 28, 1500.00);
INSERT INTO clientes (id, nome, idade, saldo) VALUES (3, 'Ricardo Borges', 42, 3200.75);
INSERT INTO clientes (id, nome, idade, saldo) VALUES (4, 'Camila Ferreira', 30, 980.00);
INSERT INTO clientes (id, nome, idade, saldo) VALUES (5, 'Gabriel Costa', 25, 750.20);

In [ ]:
# 6. Consultas e Funções Agregadas
# a) Selecione o nome e a idade dos clientes com idade superior a 30 anos:
SELECT nome, idade FROM clientes WHERE idade > 30;

# b) Calcule o saldo médio dos clientes:
SELECT AVG(saldo) FROM clientes;

# c) Encontre o cliente com o saldo máximo:
SELECT nome, saldo FROM clientes WHERE saldo = (SELECT MAX(saldo) FROM clientes);

# d) Conte quantos clientes têm saldo acima de 1000:
SELECT COUNT(*) FROM clientes WHERE saldo > 1000;

In [ ]:
# 7. Atualização e Remoção com Condições
# a) Atualizar o saldo de um cliente específico:
UPDATE clientes SET saldo = 3000.00 WHERE id = 2;

# b) Remover um cliente pelo seu ID:
DELETE FROM clientes WHERE id = 5;

In [ ]:
# 8. Junção de Tabelas
# a) Crie a tabela "compras" e insira dados:
CREATE TABLE compras (
    id INT PRIMARY KEY,
    cliente_id INT,
    produto TEXT,
    valor FLOAT,
    FOREIGN KEY (cliente_id) REFERENCES clientes(id)
);

INSERT INTO compras (id, cliente_id, produto, valor) VALUES (1, 1, 'Notebook', 2000.00);
INSERT INTO compras (id, cliente_id, produto, valor) VALUES (2, 2, 'Smartphone', 1500.00);
INSERT INTO compras (id, cliente_id, produto, valor) VALUES (3, 3, 'Tablet', 800.00);
INSERT INTO compras (id, cliente_id, produto, valor) VALUES (4, 4, 'Monitor', 500.00);
INSERT INTO compras (id, cliente_id, produto, valor) VALUES (5, 1, 'Teclado', 150.00);

# b) Escreva uma consulta para exibir o nome do cliente, o produto e o valor de cada compra:
SELECT clientes.nome, compras.produto, compras.valor
FROM compras
JOIN clientes ON compras.cliente_id = clientes.id;